# language: uk
@epic1 @auth
Функціонал: Реєстрація та Авторизація користувача
  Як Гість або Користувач,
  Я хочу мати можливість реєструватися, входити та виходити з системи.

  Передумова:
    Дано Гість знаходиться на сторінці "/register"

  @us-101 @happy-path
  Сценарій: Успішна реєстрація нового користувача
    І Гість вводить наступні валідні дані:
      | Поле                 | Значення         |
      | Нікнейм              | new_user         |
      | Email                | user@example.com |
      | Пароль               | Password123      |
      | Підтвердження пароля | Password123      |
    Коли Гість натискає кнопку "Зареєструватися"
    Тоді Система створює нового користувача "new_user" в базі даних
    І Користувач "new_user" автоматично авторизований
    І Користувача перенаправлено на головну сторінку "/"

  @us-101 @negative-path
  Сценарій: Реєстрація з нікнеймом, що вже існує
    І В базі даних існує користувач з нікнеймом "existing_user"
    Коли Гість намагається зареєструватися з нікнеймом "existing_user"
    Тоді Система не створює нового користувача
    І Система показує повідомлення про помилку "Цей нікнейм вже зайнятий"

  @us-101 @negative-path @brl-2
  Сценарій: Реєстрація з паролем, що не відповідає політиці безпеки
    Коли Гість вводить пароль "pass"
    І Гість натискає кнопку "Зареєструватися"
    Тоді Система показує повідомлення про помилку "Пароль повинен містити щонайменше 8 символів"

  @us-102 @happy-path
  Сценарій: Успішна авторизація (Логін)
    Дано Гість знаходиться на сторінці "/login"
    Коли Гість вводить "user" в поле "Нікнейм або Email"
    І Гість вводить "Password123" в поле "Пароль"
    І Гість натискає кнопку "Увійти"
    Тоді Користувач "user" авторизований
    І Користувача перенаправлено на головну сторінку "/"

  @us-103 @happy-path
  Сценарій: Успішний вихід (Logout)
    Дано Користувач "user" авторизований в системі
    Коли Користувач натискає кнопку "Вийти"
    Тоді Сесія користувача завершена
    І Користувача перенаправлено на головну сторінку "/"