# language: uk
@epic7 @admin
Функціонал: Адміністрування системи

  Передумова:
    Дано Існує "admin" (Адміністратор) та "user" (Користувач)

  @us-701 @happy-path
  Сценарій: Адміністратор змінює роль користувача
    Дано "admin" знаходиться в "Панелі адміністратора"
    Коли Він змінює роль "user" на "Модератор"
    Тоді Роль користувача в базі даних оновлюється на "Moderator"

  @us-702 @happy-path @soft-delete
  Сценарій: Адміністратор видаляє медіа-контент
    Дано "admin" знаходиться в "Керування медіа"
    Коли Він натискає "Видалити" для медіа "Dune"
    Тоді Медіа "Dune" позначається як видалене (Soft Delete)
    І Воно зникає з результатів пошуку

  @us-703 @happy-path
  Сценарій: Адміністратор переглядає статистику
    Коли "admin" обирає проміжок часу для статистики
    Тоді Система відображає дані про нових користувачів та рецензії за цей період