# language: uk
@epic8 @collections
Функціонал: Керування Списками (Добірками)

  Передумова:
    Дано Користувач "user_A" авторизований

  @us-801 @happy-path
  Сценарій: Користувач створює новий список
    Коли Він створює список з назвою "Моя фантастика"
    Тоді Система створює нову добірку
    І Вона є публічною за замовчуванням

  @us-802 @happy-path
  Сценарій: Користувач додає медіа до списку
    Дано "user_A" має список "Моя фантастика"
    Коли Він додає "Dune" до цього списку зі сторінки медіа
    Тоді Система створює запис у добірці

  @us-803 @happy-path
  Сценарій: Власник робить список приватним
    Дано "user_A" має публічний список
    Коли Він змінює налаштування приватності на "Приватний"
    Тоді Інші користувачі більше не бачать цей список у профілі "user_A"

  @us-804 @happy-path
  Сценарій: Власник надає доступ до приватного списку
    Дано Список "Моя фантастика" є приватним
    Коли "user_A" надає доступ користувачу "user_B"
    Тоді "user_B" може переглядати цей список