# language: uk
@epic9 @search
Функціонал: Пошук та кешування медіа

  Передумова:
    Дано В локальній базі є фільм "Бійцівський клуб"
    І В зовнішньому API є фільм "Dune" (якого немає локально)

  @us-901 @happy-path
  Сценарій: Пошук медіа (зведені результати)
    Коли Користувач вводить "Dune" у пошук
    Тоді Він бачить "Dune" (знайдено у зовнішньому API)
    Коли Користувач вводить "Бійцівський" у пошук
    Тоді Він бачить "Бійцівський клуб" (знайдено локально)

  @us-902 @happy-path
  Сценарій: Кешування медіа при першому перегляді
    Дано Користувач переходить на сторінку фільму "Dune" з результатів API
    Тоді Система завантажує повні дані з зовнішнього API
    І Система зберігає "Dune" у локальну базу даних (кешує)
    І Користувач бачить сторінку фільму